liamsabs/ECE499-buoyancy-energy-storage-system/ece499-dspic33ck/hall-sensor-based-foc-dspic33ck256mp508-lvmc/pmsm.c
        mcappData.periodStateVar+= (((long int)mcappData.period - 
                (long int)mcappData.periodFilter)*(int)(mcappData.PeriodKFilter));
        
        mcappData.periodFilter = (int)(mcappData.periodStateVar>>15);
        
        //If it's in reverse make sure the speed and the phase inc reflect that
        if(uGF.bits.MotorState==0b01){
            mcappData.phaseInc = __builtin_mulsu((int)REVERSE,__builtin_divud((uint32_t)PHASE_INC_MULTI,
                                        (unsigned int)(mcappData.periodFilter)));

            mcappData.SpeedHall = __builtin_mulsu((int)REVERSE, __builtin_divud((uint32_t)SPEED_MULTI, 
                                        (unsigned int)(mcappData.periodFilter)));
        }
        //Otherwise it's not backwards so we good
        else if (uGF.bits.MotorState==0b10){
            
            mcappData.phaseInc = -__builtin_mulsu((int)REVERSE,__builtin_divud((uint32_t)PHASE_INC_MULTI,
                                        (unsigned int)(mcappData.periodFilter)));

            mcappData.SpeedHall = -__builtin_mulsu((int)REVERSE,__builtin_divud((uint32_t)SPEED_MULTI, 
                                        (unsigned int)(mcappData.periodFilter)));
        }
        /* if open loop */
        if (uGF.bits.OpenLoop == 1)
        {
            /* the angle is given by hall sensor in six steps */
            thetaElectrical = thetaElectricalOpenLoop;
        }
        //We are doing closed loop, add phase inclination to 
        else
        {
            /* if closed loop, angle generated by hall sensor */
            thetaElectrical = mcappData.HallTheta;

            
            mcappData.HallTheta = mcappData.HallTheta + mcappData.phaseInc; 

            if(mcappData.hallCorrectionCounter > 0)
            {
                mcappData.HallTheta = mcappData.HallTheta + mcappData.hallCorrectionFactor;
                mcappData.hallCorrectionCounter--;
            }
        }


        MC_CalculateSineCosine_Assembly_Ram(thetaElectrical,&sincosTheta);
        MC_TransformParkInverse_Assembly(&vdq,&sincosTheta,&valphabeta);

        MC_TransformClarkeInverseSwappedInput_Assembly(&valphabeta,&vabc);

        MC_CalculateSpaceVectorPhaseShifted_Assembly(&vabc,pwmPeriod,
                                                    &pwmDutycycle);
        PWMDutyCycleSet(&pwmDutycycle);            
    }
  
    else
    {
        mcappData.SpeedHall=0;
        INVERTERA_PWM_TRIGA = ADC_SAMPLING_POINT;
        pwmDutycycle.dutycycle3 = MIN_DUTY;
        pwmDutycycle.dutycycle2 = MIN_DUTY;
        pwmDutycycle.dutycycle1 = MIN_DUTY;
        PWMDutyCycleSet(&pwmDutycycle);
    } 

   
    //If the offset value wasn't recently updated we measure it.
    if (MCAPP_MeasureCurrentOffsetStatus(&measureInputs) == 0)
    {
       //
        MCAPP_MeasureCurrentOffset(&measureInputs);
    }
    else
    {
        //Increments number of times it's entered ISR, don't know why we only do this sometimes
        BoardServiceStepIsr(); 
    }
    
    //Need to change the potvalue, this will instead be controlled by spi inputs
    measureInputs.potValue = (int16_t)( ADCBUF_SPEED_REF_A>>1);
    
    
    measureInputs.dcBusVoltage = (int16_t)( ADCBUF_VBUS_A>>1);

    //Measuring temp is good for errors
    MCAPP_MeasureTemperature(&measureInputs,(int16_t)(ADCBUF_MOSFET_TEMP_A>>1));

    //Update X2C scope
    DiagnosticsStepIsr();
    
    // State and message processing logic
    if(++ISRCounter>=SENSOR_SAMPLE_RATE_REVS){
        //If the counter is at max then we send an update
        SPIFlag = 1;
        //This is used later, so we hold onto this
        //If the motor is off we want to set the offset current of the Ibus to this to compensate
        //For current flowing through internal circuitry
        
    }



    /* Read ADC Buffet to Clear Flag */
	adcDataBuffer = ClearADCIF_ReadADCBUF();
    ClearADCIF();   
}

void __attribute__((interrupt, no_auto_psv)) _SPI1RXInterrupt(void)
{
    
    // Check if SPI receive buffer is full
    if (SPI1STATLbits.SPIRBF == 0x01) {
        
        rxBuffer = SPI1BUFL;  // Read received data
        //Check to make sure it's actually requesting a 0 transmit
        if(rxBuffer!=0){
        /* If this sends sensor data*/
            while(1U == SPI1STATLbits.SPITBF); //wait to make sure SPI transfer buffer is not full
            SPI1BUFL = txBuffer[txCounter];  // Transmit first byte then increment
            txCounter++;
            //IEC0bits.SPI1RXIE = 0; //disable SPI1 Recieve Interrupt
            SPI1IMSKLbits.SPITBEN = 1;  //sets interrupt to trigger on SPI transmit buffer empty
            IEC0bits.SPI1TXIE = 1; //enable SPI1 Transmit Interrupt
            IFS0bits.SPI1TXIF = 0; //clear TX interrupt flag 
            if(rxBuffer!=0x04){
                //Prompt that there has been a state change request if it's not just a data request
                RXFlag = 1;
            }
        }
               
    }
    
    SPI1BUFL = 0;
    SPI1BUFH = 0;
    
    // Clear SPI interrupt flag
    IFS0bits.SPI1RXIF = 0;    // Clear SPI1 interrupt flag  
}

void __attribute__((interrupt, no_auto_psv)) _SPI1TXInterrupt(void)
{
    if (txCounter < SPI_TX_BUFFER_SIZE) {
        while (SPI1STATLbits.SPITBF);
        //SPI1BUFL = txBufferDummy[txCounter];  // Transmit byte then increment
        SPI1BUFL = txBuffer[txCounter];
        txCounter++;
        if (txCounter >= SPI_TX_BUFFER_SIZE) { // If last byte of response sent
            IEC0bits.SPI1TXIE = 0; // Disable SPI1 Transmit Interrupt
            SPI1IMSKLbits.SPITBEN = 0;  //disable interrupt to trigger on SPI transmit buffer empty
            //IEC0bits.SPI1RXIE = 1; // Enable SPI1 Receive Interrupt
            IFS0bits.SPI1RXIF = 0; // clear recieve interrupt flag
            txCounter = 0; // Reset txCounter for next transmission
            SPITrigger = 0; //clear PORTE1 (MicroBus_A_AN) to trigger future interrupts on master
        }
    }

    IFS0bits.SPI1TXIF = 0; // Clear TX interrupt flag
}
// *****************************************************************************
/* Function:
 UpdateState(void)

  Summary:
  Updates Motor state based on the data received from SPI

  Description:
 
  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

